; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v2 ?v3)
             (pred_10 ?v12 ?v4)
             (pred_7 ?v2 ?v4)
             (pred_2 ?v10 ?v2 )
	     (pred_5 ?v2)
             (pred_6 ?v8)
             (pred_8 ?v12)
             (pred_11 ?v4)
             (pred_9 ?v2)
             (pred_4 ?v12)
             (pred_12 ?v2)
             (pred_1 ))



(:action op_4
:parameters (?v5 ?v11 ?v1 ?v6)
:precondition (and (pred_6 ?v5) (pred_6 ?v11) (pred_8 ?v1) (pred_11 ?v6)
          (pred_3 ?v5 ?v11) (pred_10 ?v1 ?v6)
                   (pred_7 ?v11 ?v6) (pred_5 ?v5) 
                   (pred_9 ?v11) (pred_4 ?v1))
:effect (and  (pred_12 ?v11) (not (pred_9 ?v11))))


(:action op_5
:parameters (?v5 ?v13)
:precondition (and (pred_6 ?v5) (pred_6 ?v13)
               (pred_5 ?v5) (pred_3 ?v5 ?v13) (pred_12 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v5))))

(:action op_1
:parameters (?v5 ?v1)
:precondition (and (pred_6 ?v5) (pred_8 ?v1) 
                  (pred_5 ?v5) (pred_2 ?v1 ?v5) (pred_1 ))
:effect (and (pred_4 ?v1)
   (not (pred_2 ?v1 ?v5)) (not (pred_1 ))))


(:action op_3
:parameters (?v5 ?v7 ?v9)
:precondition (and (pred_6 ?v5) (pred_8 ?v7) (pred_8 ?v9)
                  (pred_5 ?v5) (pred_4 ?v9) (pred_2 ?v7 ?v5))
:effect (and (pred_4 ?v7) (pred_2 ?v9 ?v5)
        (not (pred_4 ?v9)) (not (pred_2 ?v7 ?v5))))

(:action op_2
:parameters (?v5 ?v1)
:precondition (and (pred_6 ?v5) (pred_8 ?v1) 
                  (pred_5 ?v5) (pred_4 ?v1))
:effect (and (pred_1 ) (pred_2 ?v1 ?v5) (not (pred_4 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_15 obj_08 obj_18 obj_17 obj_03 obj_06 obj_16 obj_01 obj_10 obj_11 obj_04 obj_05 obj_02 obj_14 obj_13 obj_19
    obj_20 obj_09
    obj_12 obj_07
    )

    (:init
       (pred_1)

       (pred_6 obj_15)
       (pred_6 obj_08)
       (pred_6 obj_18)
       (pred_6 obj_17)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_6 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_11)
       (pred_6 obj_04)
       (pred_6 obj_05)
       (pred_6 obj_02)
       (pred_6 obj_14)
       (pred_6 obj_13)
       (pred_6 obj_19)
       (pred_11 obj_20)
       (pred_11 obj_09)
       (pred_8 obj_12)
       (pred_8 obj_07)

       (pred_3 obj_15 obj_03)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_18 obj_08)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_03 obj_06)
       (pred_3 obj_03 obj_15)
       (pred_3 obj_06 obj_11)
       (pred_3 obj_06 obj_16)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_06 obj_03)
       (pred_3 obj_16 obj_04)
       (pred_3 obj_16 obj_01)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_16 obj_06)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_16)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_10 obj_11)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_11 obj_14)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_11 obj_06)
       (pred_3 obj_11 obj_10)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_04 obj_16)
       (pred_3 obj_04 obj_11)
       (pred_3 obj_05 obj_19)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_14 obj_13)
       (pred_3 obj_14 obj_11)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_13 obj_19)
       (pred_3 obj_13 obj_04)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_19 obj_05)
       (pred_3 obj_19 obj_13)
       (pred_9 obj_13)
       (pred_9 obj_17)
       (pred_7  obj_13 obj_20)
       (pred_7  obj_17 obj_09)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_18)
       (pred_12 obj_03)
       (pred_12 obj_06)
       (pred_12 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_05)
       (pred_12 obj_02)
       (pred_12 obj_14)
       (pred_12 obj_19)

       (pred_10  obj_12 obj_20)
       (pred_10  obj_07 obj_09)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_07 obj_08)
       (pred_5 obj_08)
    )

    (:goal (and
       (pred_2 obj_07 obj_05)
    ))
(:constraints
  (always (not (pred_5 obj_16)))
)
)

; plan
1. (op_1 obj_08 obj_07)
   deleted: (pred_2 obj_07 obj_08) (pred_1)
   added: (pred_4 obj_07)
   goals met: 0 of 1
2. (op_5 obj_08 obj_06)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_06)
   goals met: 0 of 1
3. (op_5 obj_06 obj_11)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_04)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_04)
   goals met: 0 of 1
5. (op_5 obj_04 obj_05)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_05)
   goals met: 0 of 1
6. (op_2 obj_05 obj_07)
   deleted: (pred_4 obj_07)
   added: (pred_1) (pred_2 obj_07 obj_05)
   goals met: 1 of 1
